---
kind: other
id: Properties.T:Autodesk.Revit.DB.CADLinkOptions
source: html/98a3ffa1-2af8-22b8-c054-639001c4ad8f.htm
---
# CADLinkOptions Properties

Specifies whether the .NET object represents a valid Revit entity.